# Cadence Genus(TM) Synthesis Solution, Version 19.11-s087_1, built Aug 13 2019 11:48:07

# Date: Sat Dec 03 18:49:24 2022
# Host: cn94.it.auth.gr (x86_64 w/Linux 3.10.0-1160.76.1.el7.x86_64) (1core*12cpus*23physical cpus*AMD EPYC 7352 24-Core Processor 512KB)
# OS:   CentOS Linux release 7.9.2009 (Core)

set_db init_lib_search_path "/mnt/apps/prebuilt/eda/designkits/GPDK/gsclib045/lan/flow/t1u1/reference_libs/GPDK045/gsclib045_svt_v4.4/gsclib045/timing"
set_db script_search_path "/mnt/scratch_b/users/k/karamitopp/Desktop/"
set_db init_hdl_search_path "/mnt/scratch_b/users/k/karamitopp/Desktop/"
set_db library slow_vdd1v0_basicCells.lib
set_db lef_library "/mnt/apps/prebuilt/eda/designkits/GPDK/gsclib045/lan/flow/t1u1/reference_libs/GPDK045/gsclib045_svt_v4.4/gsclib045/lef/gsclib045_tech.lef"
set_db lef_library "/mnt/apps/prebuilt/eda/designkits/GPDK/gsclib045/lan/flow/t1u1/reference_libs/GPDK045/gsclib045_svt_v4.4/gsclib045/lef/gsclib045_macro.lef"
read_qrc "/mnt/apps/prebuilt/eda/designkits/GPDK/gsclib045/lan/flow/t1u1/reference_libs/GPDK045/gsclib045_svt_v4.4/gsclib045/qrc/qx/gpdk045.tch"
read_hdl picorv32.v
elaborate "picorv32"
check_design -all
set_db / .use_scan_seqs_for_non_dft false
read_sdc synthesis_constraints.sdc
check_timing_intent
syn_generic
syn_map
syn_opt
report_area > ex5_report_area_step6.txt
report_timing > ex5_report_timing_step6.txt
report_gates > ex5_report_gates_step6.txt
report_power > ex5_report_power_step6.txt
write_design -innovus picorv32
