# Version:1.0 MMMC View Definition File
# Do Not Remove Above Line
create_rc_corner -name default_emulate_rc_corner -T {0.0} -preRoute_res {1.0} -preRoute_cap {1.0} -preRoute_clkres {0.0} -preRoute_clkcap {0.0} -postRoute_res {1.0 1.0 1.0} -postRoute_cap {1.0 1.0 1.0} -postRoute_xcap {1.0 1.0 1.0} -postRoute_clkres {1.0 1.0 1.0} -postRoute_clkcap {1.0 1.0 1.0} -qx_tech_file {../../../../apps/prebuilt/eda/designkits/GPDK/gsclib045/lan/flow/t1u1/reference_libs/GPDK045/gsclib045_svt_v4.4/gsclib045/qrc/qx/gpdk045.tch}
create_op_cond -name default_emulate_opcond -library_file {../../../../apps/prebuilt/eda/designkits/GPDK/gsclib045/lan/flow/t1u1/reference_libs/GPDK045/gsclib045_svt_v4.4/gsclib045/timing/fast_vdd1v0_basicCells.lib} -P {1.0} -V {1.1} -T {0.0}
create_library_set -name default_emulate_libset_max -timing {../../../../apps/prebuilt/eda/designkits/GPDK/gsclib045/lan/flow/t1u1/reference_libs/GPDK045/gsclib045_svt_v4.4/gsclib045/timing/fast_vdd1v0_basicCells.lib}
create_constraint_mode -name default_emulate_constraint_mode -sdc_files {ex_4_genus_invs_des/genus.default_emulate_constraint_mode.sdc}
create_delay_corner -name default_emulate_delay_corner -library_set {default_emulate_libset_max} -rc_corner {default_emulate_rc_corner}
create_analysis_view -name default_emulate_view -constraint_mode {default_emulate_constraint_mode} -delay_corner {default_emulate_delay_corner}
set_analysis_view -setup {default_emulate_view} -hold {default_emulate_view}
